{
    "navbar": {
        "home": "Home",
        "about": "About",
        "works": "Works",
        "illustrations": "Illustrations"
    },
    "home": {
        "greeting": "Hi! I’m Weltton.",
        "description": "Multidisciplinary UX Designer",
        "from": "from Brazil",
        "designPhilosophy": "I Design for Humans from Humans.",
        "headerGrid": {
            "ideation": "Ideation",
            "research": "Research",
            "empathy": "Empathy",
            "makeSimple": "Make it Simple"
        },
        "latestWorks": "Latest Works"
    },
    "about": {
        "helloHeader": "Hey, there!",
        "nameHeader": "I'm Weltton Ortega",
        "aboutIntroduction": "Brazilian UX designer that, in their spare time, also engages in my artistic side as an illustrator. I typically find myself working on personal projects and looking for methods to improve the experience. Whether it's examining current designs or generating new ideas.",
        "aboutHeader2": "My Career so far",
        "aboutText": "My background involves a degree in computer networks and working as an IT analyst, where I've been responsible for server management, database maintenance, and IT department leadership. I've gotten the opportunity to work with a variety of users in support, instruction, and training, during my time as a professional. These discussions gave me the chance to hear about their worries as well as ideas, which made me want to create programs that would solve their issues. That's how I met UX Design, immersing myself in activities such as user testing, research, interface enhancement, and feedback gathering. Because of my intimate contact with people, I always gave priority to creating solutions that addressed their demands. I made the decision that my objective would be to develop accessible and user-friendly solutions and designs after realizing that many readily available solutions were not used effectively owing to bad design choices, creating confusion and unease among users. I hope to have a positive impact on people's lives in this way. I was inspired to pursue a profession in UX design because of this."
    },
    "hotelAvenida": {
        "job": "IT Analyst / UI/UX Designer",
        "paragraph1": "The Avenida Hotel project began in 2019 with the goal of building a modern and functional website that could be integrated with the hotel's reservation engine. One of the main objectives was to make online booking easy and consistent.",
        "paragraph2": "The development was carried out using WordPress and employed a page structure with custom modular themes to facilitate maintenance according to the hotel's requirements.",
        "paragraph3": "By working with WordPress to realize the Avenida Hotel's vision, we were able to address the design requirements identified through competitive analyses and also meet design demands. This approach allowed for the creation of a digital presence that aligned with the hotel's identity and catered to market demands.",
        "paragraph4": "The collaborative card sorting process helped define the information architecture. This participatory method created effective navigation that facilitates visitors' exploration, aiding them in easily finding everything they need, from room information to facilities and events.",
        "paragraph5": "We highlight the successful integration between the website and the hotel system's reservation engine, enabling guests to effortlessly search for accommodation options and make reservations. This robust implementation provides a seamless experience from the initial search to the check-out moment."
    },
    "agrosolDesign": {
        "overviewHeader": "Overview",
        "overviewParagraph": "The Agro-sol Design System was developed to address discrepancies that appeared during the creation of PowerApps applications. I recommended the development of a design system after realizing that the absence of standardization was harming application consistency and degrading user experience.",
        "objectiveHeader": "Objective",
        "objectiveParagraph": "The primary goal of the Agro-sol Design System was to establish robust design and development guidelines, focusing on user-centricity, inclusivity, simplicity, and consistency. The system wanted to standardize application functionality and visual design in order to give consumers a seamless and enjoyable experience.",
        "methodologyHeader": "Methodology",
        "methodologyParagraph": "The design system construction process adopted the Atomic Design System methodology, developed by Brad Frost in 2013. This project was divided into three fundamental stages:",
        "image1Description": "Atomic Design Structure.",
        "stage1Header": "Stage 1 - Pattern Mapping",
        "stage1Paragraph": "A thorough mapping of design patterns, including their structures, colors, typography, icons, and components, was done in this phase. This made it easier to build a strong system foundation and ensured aesthetic and functional uniformity across all apps.",
        "stage2Header": "Stage 2 - Best Practices Documentation",
        "stage2Paragraph": "After mapping all components, focus was shifted towards creating documentation outlining best practices for screen construction and the use of system components. This ensured alignment with established guidelines.",
        "stage3Header": "Stage 3 - Future Preparedness",
        "stage3Paragraphg": "The third stage centered around future activities. This encompassed the ongoing review of the design system to meet ever-evolving accessibility requirements, as well as preparing the design system for application beyond the PowerApps environment, thereby expanding its impact.",
        "image2Description": "Small Part of UI Library.",
        "outcomeHeader": "Outcome",
        "outcomeParagraph": "By embracing consistent and user-centered design practices, optimizing development, improving usability, and delivering a more cohesive experience across all interactions, the design system has made a significant impact. The design system is poised to evolve to meet the growing demands of accessibility and to be applied in a variety of contexts, ensuring a user experience across diverse platforms."
    },
    "redesignPortfolio": {
        "introductionHeader": "Introduction",
        "introductionParagraph": "I decided to improve my portfolio and show it more engagingly after becoming a professional in the field of user experience design (UX). After looking through my previously released portfolio, it gave the impression that I was looking for ways to get into the UX industry and present my knowledge. The projects in this initial portfolio, which I put together while earning the Google UX certification through Coursera, were ones I worked on throughout the course and as an IT analyst. Although it was a significant turning point, once I began working in the industry directly, I felt the need to create a fresh portfolio that better reflected my work and personality.",
        "introductionParagraph2": "One of the most significant changes I made was creating a page that presented the projects clearly and approached my work more directly. Although I had chosen a One Page website format for my previous portfolio, some comments mentioned that it was too lengthy. Taking advantage of this feedback, I decided to build a new portfolio with topics divided into separate pages to provide a better user experience.",
        "image1Description1": "A comparison of the hero section portfolios from the old and new.",
        "challengeHeader": "Challenge",
        "challengeParagraph1": "The biggest difficulty I faced with this project was learning something completely new to use. In the past, when I worked as an analyst, I used Wordpress with modular themes or the Hugo Framework. I challenged myself in this project and tried to create a portfolio from scratch, following the end-to-end process, making a prototype, writing the code, and deploying it to production. After completing the research and prototyping stages, I took some JavaScript courses and Chakra UI classes, and started turning my prototype into code.",
        "challengeParagraph2": "My deepest gratitude goes to a front-end friend who had patience with me for hours, answering numerous questions and teaching me best practices. Although I believe there's still much to improve, I'm happy with the development of my portfolio.",
        "illustrationsHeader": "Illustrations",
        "illustrationsParagraph": "Another important point was the separation of pages related to my UX Design work and illustration, as the latter is an activity I engage in more as a hobby and freelancer. I chose not to delete it from my portfolio because, in specific cases, I send it to people who contact me with an interest in that aspect. Additionally, I consider illustration to be a part of my personality, so I decided to create a dedicated page for it, where I can showcase images with the desired quality, unlike social media platforms like Instagram, where the images tend to lose their quality and are primarily used for social purposes.",
        "image1Description2": "A comparison between the new Illustration dedicated page and previous Illustration section.",
        "languageHeader": "Incorporating Languages",
        "languageParagraph1": "In this phase of portfolio development, I aimed to incorporate a second language to communicate with a broader audience, showcase greater credibility and language proficiency, aid in SEO and page visibility, as well as enhance accessibility.",
        "languageParagraph2": "Adapting the text and creating content designed for both languages were the main challenges encountered during this stage. In my previous portfolio, not all content was translated and, eventually, was set aside. I ensured that all content was translated in this stage of my development. Another challenge was learning to use the react-i18next library for internationalization (i18n), adapting the site to support two languages, which posed an additional challenge.",
        "image1Description": "Header Bar with language option",
        "conclusionHeader": "Conclusion",
        "conclusionParagraph1": "In the execution of this project, both on a personal and professional level, I dedicated myself to revamping my portfolio, aiming to infuse it with my identity. I tackled each stage of the process, from initial conception to implementation, undergoing comprehensive testing with diverse user groups. The feedback from these evaluations was crucial: I adapted the project based on the needs and insights gathered.",
        "conclusionParagraph2": "The experience of delving into front-end development, aided by friends and the opportunity to collaborate directly in the coding process.",
        "conclusionParagraph3": "There are several aspects that I acknowledge as capable of improvement in my portfolio. These enhancements will be implemented progressively, focusing on elevating code quality and optimizing website responsiveness. Additionally, the need to revisit my portfolio regarding accessibility, adhering to standards set by WCAG.",
        "conclusionParagraph4": "My dedication to improving this portfolio will persist, as I strive to document my professional evolution and the projects that lie ahead over time.",
        "button": "Check Prototype"
    }
}